---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.GlobalParamFormulaCircularChain
source: html/ea239989-58bc-05dd-eeb7-467049418534.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.GlobalParamFormulaCircularChain Property

A formula in a global parameter causes a circular chain of references between highlighted elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId GlobalParamFormulaCircularChain { get; }
```